# Above Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegment..::..Above Property
DimensionSegment Class See Also
---
The text shown above the segment's value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Above { get; set; }
```

Visual Basic
---
```text
Public Property Above As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Above {
	String^ get ();
	void set (String^ value);
}
```

# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace